{
  "timestamp": "2025-06-15T07:49:44.512675",
  "summary": {
    "total_processed": 28,
    "successful_extractions": 28,
    "failed_extractions": 0,
    "success_rate": 100.0,
    "ocr_usage_percentage": 0.0,
    "avg_extraction_time": 41.645973231111256
  },
  "field_analysis": {
    "empty_fields": {},
    "field_confidence": {}
  },
  "skills_analysis": {
    "categories": {
      "technical_skills": {
        "count": 0,
        "skills": []
      },
      "business_skills": {
        "count": 0,
        "skills": []
      },
      "creative_skills": {
        "count": 0,
        "skills": []
      },
      "communication_skills": {
        "count": 0,
        "skills": []
      },
      "industry_skills": {
        "count": 0,
        "skills": []
      },
      "soft_skills": {
        "count": 0,
        "skills": []
      },
      "other_skills": {
        "count": 0,
        "skills": []
      }
    },
    "total_skills": 0,
    "unique_skills": 0
  },
  "resume_details": [
    {
      "resume_path": "data\\input\\.Net - TX - Hassan.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "rest": 0.9
        },
        "name": "Hassan Mwase",
        "email": "",
        "phone": "",
        "location": {
          "city": "",
          "state": "",
          "zip": ""
        },
        "work_authority": "",
        "designation": "software developer",
        "experience": "Professional Experience Secret Security",
        "tax_term": "",
        "confidence": 0.22695
      }
    },
    {
      "resume_path": "data\\input\\Affzal_SrDeveloperResumeS.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "SRS": 0.9,
          "reporting": 0.9,
          "sql": 0.9,
          "sql server": 0.9,
          "analysis": 0.9,
          "business analysis": 0.9,
          "safe": 0.9,
          "version control": 0.9
        },
        "name": "AFFZAL ABDUL  \nD",
        "email": "",
        "phone": "",
        "location": {
          "city": "",
          "state": "",
          "zip": ""
        },
        "work_authority": "",
        "designation": "Developer",
        "experience": "PROFESSIONAL EXPERIENCE Anthem Inc.\n, Norfolk , VA Mar 2017– Till date Developer Sr.\nAnthem Inc .\nis an American health insurance company founded in the 1940s, prior to 2014 known as WellPoint, Inc.\nIt is the largest for -profit managed health care company in the Blue Cross and Blue Shield Association .\nIt covers 7 .7 million seniors, people with disabilities, low -income families and other state and federally sponsored beneficiaries, and federal employees in 26 states, making it the nation’s largest provider of health care for public programs .\nResponsibilities: • Expertise in Provider dealing with legacy system to load files from states into the FACETS application.\nExpertise in Provider business domai n area and the flow of the FACETS application.\nin-depth knowledge of both providers in FACETS.\n• Apply the Business rules on the data coming from multiple operating markets.\nMaintain the business rules in a table for visibility to all required processes.\n• Actively worked in gathering requirements with SA and PO to convert them to technical documents for the deve lopment to initiate in Jira.\n• Used JIRA, SVN Tortoise & Bit bucket for code repository and logged / tracked the activities in the team.\nAlso CTU tool for code deployments.\n• Used Splunk for parsing complex files and Splunk language ( SPQL ) to make the searches and created dashboards on the data.\nAlso configured notifications as requested by the business.\n• Did POC for DevOps tools and deeper research on both Sisense and Tableau tools for utilizing them as data visualization purposes across the provider department.\n• Have hands on experience in pulling data from JIRA using REST calls thru PowerShell scripting and load them to SQL db.\nAlso did dashboards on the loaded data and provi ded support for the created dashboards in tableau .\n• Used Python to massage the data in REST calls using JIRA libraries and loading them to database.\nBuilt dashboards on top the loaded data for project management team.\n• Checked the configuration and performance of the existing databases including data file allocation, index, fill factor, fragmentation and the impact on system performance.\nAnalyzed potential problems (response delay, locking, server down time, etc.) to avo id and optimize.\n• Actively involved with production support ( 24*7) and Development environment.\n• Used Premise to trace the slow running queries and tried to Optimize SQL queries for improved performance and availability.\nAlso used precise tool for reviewin g the performance.\n• Actively involved in code reviews and mentoring the developers.\nAnd also involved in development activities.\n• Excellent Team Building, Project Management, Analytical, Interpersonal & Communication",
        "tax_term": "",
        "confidence": 0.265
      }
    },
    {
      "resume_path": "data\\input\\Data Entry - NY - Lauren.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "medical": 0.9
        },
        "name": "Lauren Dubin",
        "email": "",
        "phone": "",
        "location": {
          "city": "BRONX",
          "state": "NY",
          "zip": "10468"
        },
        "work_authority": "S",
        "designation": "Data",
        "experience": "PROFESSIONAL EXPERIENCE Metropol itan Transportation Authority August 2017 -PRESENT Bronx, NY Data Entry/Office assistant • Comparing data entered with source documents.\n• Correcting errors when appropriate.\n• Maintaining required records of all completed work and compiling weekly reports.\n• Assist in maintaining filing system by organizing, purging, maintaining and retrieving files.\n• Clerical duties as assigned Acacia Network, Bronx, NY December 2016 – June 2017 Medical Scribe • Anticipate physician needs to facilitate the flow of clinics.\n• Accurately and thoroughly record patient medical history an d physical exam, procedures and treatments performed by healthcare professionals, including nurses and physician assistants.\n• Patient",
        "tax_term": "",
        "confidence": 0.4088666666666667
      }
    },
    {
      "resume_path": "data\\input\\David Buchberger - Security - OH.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "itil": 0.8,
          "analysis": 0.8,
          "attention to detail": 0.8,
          "organization": 0.8,
          "networking": 0.8,
          "documentation": 0.8,
          "defense": 0.8,
          "education": 0.6,
          "policy": 0.8,
          "infrastructure": 0.8,
          "engineering": 0.8,
          "customer service": 0.8,
          "technical support": 0.8,
          "compliance": 0.8,
          "risk management": 0.8,
          "governance": 0.8,
          "security": 0.8,
          "information security": 0.8,
          "incident response": 0.8,
          "security operations center": 0.8,
          "patch management": 0.8,
          "security operations": 0.8,
          "security engineering": 0.8,
          "security tools": 0.8,
          "nessus": 0.8,
          "symantec": 0.8,
          "mcafee": 0.8,
          "carbon black": 0.8,
          "fireeye": 0.8,
          "access management": 0.8,
          "siem": 0.8
        },
        "name": "David Buchberger",
        "email": "",
        "phone": "6142029370",
        "location": {
          "city": "Sugar Grove",
          "state": "OH",
          "zip": "43155"
        },
        "work_authority": "",
        "designation": "Security Analyst",
        "experience": "EMPLOYMENT HISTORY August 2018 – February 2020 Infinite Contract State of Ohio – Office of Information Security and Privacy Tier 1 Cyber Security Analyst • Respond to assigned tickets using ServiceNow • Remediate phishing attacks using Microsoft Defender Advanced Threat Protection, Office 365, and Symantec Management Center • Use Symantec Web Analytics to allow approved access to Web page URLS • Assist Tier 2 and Tier 3 with tickets as needed • Use McAffe ePO to detect malware on servers and desktops • Use Tanium to troubleshoot infected systems 2015 – 2018 Battelle Columbus, OH Network Systems Analyst II (Security Operations Center/Vulnerability Management) • Scan Network with Nessus Manager and Professional • Create and monitor Scan schedule • Build Nessus Agent Groups • Perform credentialed, Non-credentialed and Agent scans on servers and workstations • Perform credentialed and Non-Credentialed WAS and DMZ scans • Perform internal and external Discovery scans • Work with clients to resolve Nessus plugin scan requirements • Prioritize network vulnerability threat with Kenna Security • Monitor Kenna Security Connector tunnel Nessus file upload integrity • Assign and track ServiceNow vulnerability remediation requests • Provide vulnerability remediation assistance to server Admins • Maintain Access Management CMDB • Create reports for upper management • Create detailed instructional documentation • SOC exposure to SIEM tools i.e.\nCarbon Black (Response and Defense), FireEye, 2013 – 2015 Battelle Columbus, OH Network Systems Analyst II (Internal Network) • Maintain 2FA (RSA Token, Terminal Server and VMware) NIST FISMA and HIPAA environment • Verify VEEAM backup integrity, create reports and post to SharePoint for client review • Troubleshoot, install, and remove third party applications • Troubleshoot network connectivity issues • Troubleshoot printer issues • Install updates • Remediate vulnerabilities • Familiarity with Microsoft Group Policy objects as it applies to workstations • Experience with Microsoft Direct Access • Submit Firewall and Switch RFC • Assist remote Users • Create monthly internal network vulnerability report 2006 – 2013 Battelle Columbus, OH Sr.\nComm/Equip Spec III (20,000+ User environment) Resume – David Buchberger 2 2002 – 2006 Arlington Computer Products (Discover Card) Columbus, OH PC Technician (3,500+ User environment) 2001 – 2002 TEKsystems (Columbia Gas) Columbus, OH PC Technician (1,000+ User environment) 2000 -2001 National Board of BPVI Columbus, OH Technical Support Specialist (100+ User environment) 1998 – 2000 United Parcel Service Columbus, OH PC Technician (100+ User environment) KEY",
        "tax_term": "CONTRACT",
        "confidence": 0.5290322580645161
      }
    },
    {
      "resume_path": "data\\input\\David Musia - Mainframe - TX.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "sas": 0.9,
          "customer service": 0.9,
          "compliance": 0.9,
          "scala": 0.9,
          "problem management": 0.9,
          "incident management": 0.9,
          "change management": 0.9,
          "lit": 0.9,
          "time management": 0.9,
          "planning": 0.9,
          "analysis": 0.9,
          "root cause analysis": 0.9
        },
        "name": "David Musia  \nDenton",
        "email": "",
        "phone": "",
        "location": {
          "city": "TX",
          "state": "TX",
          "zip": "76210"
        },
        "work_authority": "",
        "designation": "Project Administration",
        "experience": "WORK EXPERIENCE Senior Mainframe Operator DXC Technology (from EDS) 2000 – 2019 Hewlett Packard Enterprises (HPE) merged with DXC Technology 2017 Hewlett Packard (HP) merged with HPE 2015 Electronic Data Systems (EDS) merged with HP 2008",
        "tax_term": "",
        "confidence": 0.30351666666666666
      }
    },
    {
      "resume_path": "data\\input\\DEXTER K. NDENGABAGANIZI  - PM Program Manager - OH.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "excel": 0.9,
          "aerospace": 0.9,
          "space": 0.9,
          "chi": 0.9
        },
        "name": "PROFESSIONAL EXPERIENCE  \nC",
        "email": "",
        "phone": "2693258811",
        "location": {
          "city": "Pickerington",
          "state": "OH",
          "zip": "43147"
        },
        "work_authority": "",
        "designation": "Program Coordinator",
        "experience": "PROFESSIONAL EXPERIENCE Council on Foreign Relations (CFR) Washington, DC Assistant Director, Washington Meetings Program [May 2016 – Aug.\n2017] Program Coordinator , Washington Meetings Program [June 2015 – May 2016 ] Program Associate, Washington Meetings Program [Jan.\n201 4 – June 2015 ] Program Assistant , Washington Meetings Program [Nov .\n2012 – Jan.\n201 4]  Conceptualize d, manage d, and coordinate d internal and external events ranging from roundtables to multi -day 300+ daily attendee conferences with key policymakers across various stakeholder groups.\n Create d and m anage d relationships with key domestic and international policymakers , subject matter experts, and business leaders to participate in CFR programming and initiatives for Council members.\n Research ed, monitor ed, and evaluate d international trends to identify potential p rogramming for CFR members and the broader domestic and international political and policy community.\nResults for Development Institute Washington , DC Center for Health Market Innovations (CHMI) Intern [May 2012 – Nov.\n2012 ]  Assisted in the creation of s trategic plans to increase the visibility of dozens of health market innovations.\n Conducted needs synthesis used in the formulation of CHMI’s Web and Facebook Outreach Strategy.\nU.S.\nEmbassy: Foreign Commercial Service Singapore Foreign Commercial Service Intern [Aug.\n2011 – Jan.\n2012 ]  Conduct ed trade promotion for 1,300+ American companies and products in Singapore .\n Interviewed corporate and policy leaders, researched, and produced official U.S.\nCommercial Service Market Research Report s used in U.S.-Singaporean business facilitation s.\nHouses of the Oireachtas: Dáil Éireann (Irish National Parliament) Dublin, Ireland Research Assistant , Fine Gael [May 2011 – Aug.\n2011 ]  Researched and produced reports on various European economic policies , which were used by Members of Parliament in nationally televised parliamentary address es.\nADDITIONAL",
        "tax_term": "",
        "confidence": 0.5
      }
    },
    {
      "resume_path": "data\\input\\Enterprise Architect - LA - Vijay.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "design": 0.9,
          "business requirements": 0.9,
          "prototype": 0.9,
          "prototypes": 0.9,
          "analysis": 0.9,
          "gap analysis": 0.9,
          "risk analysis": 0.9,
          "lit": 0.9,
          "traceability matrix": 0.9,
          "pmp": 0.9,
          "safe": 0.9,
          "itil": 0.9,
          "test strategy": 0.9
        },
        "name": "Vijay Kumar Kanamarlapudi",
        "email": "",
        "phone": "",
        "location": {
          "city": "",
          "state": "",
          "zip": ""
        },
        "work_authority": "",
        "designation": "Business Architect",
        "experience": "Professional Experience Blue Cross and Blue Shield of Louisiana , Baton Rouge, LA, US 10/2018 - Present ROLE: Enterprise Business Architect SUMMARY: Worked as a n Enterprise Business Architect analyzing enterprise level impacts on ideas and demands submitted by senior management team and prepared business architecture for impacts at an enterprise level.\nDocumented Business Capabilities; Value Streams; Processes th at are impacted for each idea and prepared Architecture Blue Prints for the Baseline and Target State Business Architecture.\nRESPONSIBILITIES: • Provide d strategic consultation to assigned line -of-business (LOB) or assigned functional area(s) of business in defining or designing business capabilities and processes, functions and organizational structures.\n• Participate d in divisional enterprise strategy development, including environmental analysis, opportunity identification, value cases and business innovati on portfolio development.\n• Acted as an advocate for business needs while in parallel providing ongoing feedback on developments and initiatives within IT • Communicate d IT SLA metrics to respective areas of assigned business functions.\n• Collaborate d, facilitat ed and consult ed with business stakeholders of the areas of responsibility in planning, business case development and proposal of business initiatives in alignment with desired business capabilities.\n• Work ed with other peer business architects and EA architects to identify shared capabilities and processes and opportunities to create efficiencies across the enterprise and facilitate development of cross -functional solutions • Provide d consultation to business a nalysts on an ongoing basis in communicating divisional capability plans • At the project execution level, collaborate d extensively with Business Analysts to ensure a tight alignment between the business capabilities and high -level use case scenarios identif ied in the Solution Blueprint document and corresponding detailed requirements identified in the Business Requirements Document (BRD) that support them.\n• Participate d in enterprise architecture development, including business architecture, information archi tecture, application portfolio and technical architecture.\n• Collaborate d with the enterprise program & project management office on reporting project status, issues, risks and benefits regarding areas of responsibility.\nVijay Kumar Kanamarlapudi, TOGAF®, PMP®, CBAP®, ACP®, SAFe®4 POPM, SSM, PAHM, ITIL, SSBBP 3 • Explored ways to apply new technology to, and reuse existing technology for, business processes; research and provide information on technical trends and competitors' practices relevant to assigned LOB or assigned functional area(s) of business customers.\n• Assess ed near -term needs, using struc tured interview processes, to establish business priorities; consult with technical subject matter experts and develop alternative technical solutions; advise on options, risks, costs vs.\nbenefits, and impact on other business processes and system prioriti es.\n• Collaborate d with other IT functional areas to remain apprised of project status, and inform LOB customer management of progress; conversely, keep IT's technology and service managers aware of key LOB customer issues, identifying and resolving potentia l problems and conflicts.\n• Develop ed, motivate d and direct ed staff to create a team environment, and enable staff to fulfill the LOB customer operating objectives.\nMY DELIVERABLES: Business Architecture Blue print; Capability Mapping; Value Stream Mapping; Business Process Flow Diagram s; Business Need Analysis Document ; Data Requirements Specifications; User Interface Specifications; Gap Analysis; Prototypes; Storyboarding; User Interface Screen Flow Diagram; Business Rule Definitions .\nDELIVERABLES CONTRIBUTED TO: Non -Functional Requirements Specification; Logical Data Model; Business Need Analysis Document; Work Breakdown Structure; Test Data Sheet; Test Plan; Test Scripts; Test Strategy; Test Results Summary; Information Architecture; Project Deliverables List; Risk Register; Implementation Plan/Checkout activities ; Design Specifications; Technical Requirement Specifications ; SSO Specifications.\nBlue Cross and Blue Shi eld of Louisiana , Baton Rouge, LA, US 10/2014 – 10/2018 ROLE: Lead Business Analyst; Senior Corporate Business Analyst; Senior Enterprise Business Analyst; Scrum Master SUMMARY: Work ed as a program level business analyst overseeing the foundation to put together the operations of benefits administration of Medicare Advantage platform that Blue Cross Blue Shield of Louisiana is working to put together.\nWorked on various IT efforts to send data from BCBSLA to vendors and to receive and sto re data from external vendors.\nRESPONSIBILITIES: • Worked closely with clients to identify business needs (requirements) and the costs and benefits of implementing a proposed solution, as a project, in -order to produce an accurate business case for the proj ect • Collaborated with business owners and subject matter experts to develop an understanding of business processes and functions to aide in completing the standard project business case related to a proposed project, analyzing business requirements and ide ntifying potential business solutions; completes appropriate documentation of business case, requirements and solutions.\n• Participate d in divisional enterprise strategy development, including environmental analysis, opportunity identification, value cases and business innovation portfolio development.\n• Performed project feasibility analysis, scopes project and helps client identify altern ative solutions; assist with the development of financial worksheets related to project costs and benefits • Worked with clients to develop business process flows and to obtain a clear understanding of their business models to identify potential pro cess improvements and efficiencies Vijay Kumar Kanamarlapudi, TOGAF®, PMP®, CBAP®, ACP®, SAFe®4 POPM, SSM, PAHM, ITIL, SSBBP 4 • Ensured adherence to BCBSLA project and program processes and lifecycles to ensure business and functional requirements are understood, agreed to, documented and can be traced to measurable project success criteria.\n• Analy zed business information and process flows, gather requirements and translate to Technical specifications required for application programming and test strategy development.\n• Assisted Project Manager in preparing an appropriate transition plan for",
        "tax_term": "",
        "confidence": 0.275
      }
    },
    {
      "resume_path": "data\\input\\Horace Royal - Resume.pdf",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "seo": 0.9,
          "go": 0.9,
          "negotiation": 0.9,
          "r": 0.9,
          "government": 0.9,
          "contracts": 0.9,
          "finance": 0.9
        },
        "name": "Horace Royal",
        "email": "",
        "phone": "2402811264",
        "location": {
          "city": "Washington",
          "state": "DC",
          "zip": ""
        },
        "work_authority": "",
        "designation": "Support Specialist",
        "experience": "Work Experience Contract Closeout Specialist CTR Management November 2018 to Present Contractor) Employer: CTR Management Client: Department of Transportation (DOT) • Performs the full range of contract closeout activities pursuant to FAR 4.804, with a specialized focus on the cognizant administration functions necessary to close flexibly-priced and Cost Accounting Standards (CAS) covered contracts.\n• Achieved closeout goals each month to efficiently and effectively eliminate the contract closeout backlog.\n• Verify and coordinate closeout activities utilizing PRISM.\n• Supports the reconciliation of complex invoices.\n• Resolves issues related to de-obligated and excess funding.\n• Manages government contract billing/invoicing.\n• Closeout with a focus on Firm-Fixed Price (FFP), Labor Hour, and Time and Materials (T&M).\nContract Support Specialist CACI November 2018 to Present Contractor) Employer: CACI Client: Department of Health & Human Services (DHHS) • Performed closeouts of simplified acquisitions and various contract types (T&M, Labor, Cost Types).\n• Reviewed, prepared and submitted closeout documents.\nInput information into Contract • Management System.\nRetrieved information from various systems.\n• Processed Quick.\nReviews and filled out all annual Prime Contractor Representations and • Worked jointly and coordinate with subsidiary company stakeholders to ensure all supporting policies and procedures are in-place to ensure compliance before making certification.\n• Collect, draft, review, maintain, and retained contract file documentation.\n• Draft acquisition/contract documentation for supported official(s) including requirements package documentation, Acquisition Strategy Panel (ASP) briefing slides, Acquisition Plan (AP), Business/Contract",
        "tax_term": "CONTRACT",
        "confidence": 0.505
      }
    },
    {
      "resume_path": "data\\input\\.Net - Data Lakes - Data Bricks - CA - Mehdi.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9
        },
        "name": "Mehdi Haghdad",
        "email": "",
        "phone": "9493931150",
        "location": {
          "city": "Newport Beach",
          "state": "CA",
          "zip": "92612"
        },
        "work_authority": "",
        "designation": "Cloud Architect",
        "experience": "EXPERIENCE IN ADVANCE ENGINEERING, 10 YEARS OF EXPERIENCE IN BIG DATA, 8 YEARS IN CLOUD, MULTI-CLOUD, AZURE, AWS, GCP, 7 YEARS IN ARTIFICIAL INTELLIGENCE, ML DL CNN.\nI HAVE WORKED FOR SOME OF THE MOST PRESTIGIOUS COMPANIES IN SILICON VALLEY AND OTHER LOCATIONS SUCH AS LOCKHEED MARTIN, SPACE SYSTEMS LORAL, MICROSOFT (4 TIMES AS A SENIOR SOLUTION ARCHITECT FOR DIFFERENT MULTI-BILLION DOLLAR CLIENTS), HEWLETT PACKARD, TEXAS INSTRUMENTS, OPTUM, ACXIOM, CITIBANK, UNITED HEALTHCARE, ERICSSON, ABB ATOM, ADAPTEC BROAD LOGIC, DELL, ARGONAUT TECHNOLOGIES, BAUSCH & LOMB, DARPA, DEPARTMENT OF DEFENSE (DOD) ETC.\nI have been responsible for the development of many systems and applications from the designing board to the commercial release.\nOBJECTIVE PRIMARILY LOOKING FOR CONSULTING AND CONTRACT WORK BUT ALSO OPEN TO PERMANENT POSITIONS.\nSenior solution architect Hands On!!, Senior developer, Architect, DevOps for advance engineering in Mulit-Cloud (Azure, AWS and GCP) Big Data, Artificial Intelligence.\nCan also help to build team and lead",
        "tax_term": "CONTRACT",
        "confidence": 0.5316666666666667
      }
    },
    {
      "resume_path": "data\\input\\Akin - PM  - OH.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "consul": 0.9,
          "infrastructure": 0.9,
          "payment processing": 0.9,
          "electron": 0.9,
          "perl": 0.9,
          "initiative": 0.9,
          "design": 0.9,
          "analysis": 0.9,
          "technical requirements": 0.9,
          "documentation": 0.9,
          "chi": 0.9,
          "rds": 0.9,
          "lit": 0.9,
          "clarity": 0.9,
          "energy": 0.9,
          "scrum": 0.9,
          "gin": 0.9,
          "agile": 0.9,
          "waterfall": 0.9,
          "git": 0.9,
          "client interaction": 0.9,
          "process improvement": 0.9,
          "consulting": 0.9,
          "SRS": 0.9,
          "BRD": 0.9,
          "requirement traceability": 0.9,
          "requirement traceability matrix": 0.9,
          "traceability matrix": 0.9,
          "rest": 0.9,
          "cap": 0.9,
          "retail": 0.9,
          "data integration": 0.9,
          "authorization": 0.9,
          "compliance": 0.9,
          "rad": 0.9,
          "security": 0.9,
          "authentication": 0.9
        },
        "name": "Akin",
        "email": "",
        "phone": "",
        "location": {
          "city": "MBA",
          "state": "OH",
          "zip": "43081"
        },
        "work_authority": "",
        "designation": "Project Manager",
        "experience": "Experienced Project Manager offering Retail and Financial Services domain| |expertise | |Extensive experience managing PAYMENTS",
        "tax_term": "",
        "confidence": 0.30801666666666666
      }
    },
    {
      "resume_path": "data\\input\\Aleem Ahmed - resume.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "xp": 0.9,
          "version control": 0.9,
          "svn": 0.9,
          "git": 0.9,
          "safe": 0.9,
          "jenkins": 0.9,
          "docker": 0.9,
          "chef": 0.9,
          "puppet": 0.9,
          "ansible": 0.9,
          "kubernetes": 0.9,
          "rad": 0.9,
          "aws": 0.9,
          "ec2": 0.9,
          "openshift": 0.9,
          "java": 0.9,
          "sql": 0.9,
          "soap": 0.9,
          "web services": 0.9,
          "spring": 0.9,
          "hibernate": 0.9,
          "jdbc": 0.9,
          "shell scripting": 0.9,
          "python": 0.9,
          "oracle": 0.9,
          "lit": 0.9,
          "utilities": 0.9,
          "data integration": 0.9
        },
        "name": "IBM MQ",
        "email": "",
        "phone": "",
        "location": {
          "city": "",
          "state": "",
          "zip": ""
        },
        "work_authority": "",
        "designation": "Application  Developer",
        "experience": "Professional Experience: American Family Insurance, Madison WI (July 2015 â€“ Feb 2020) Sr.\nJava Developer Responsibilities: o Design, develop, and maintain web-based applications using Java, J2EE, Spring, Hibernate, and Oracle o Involved actively in the complete software development lifecycle, including performance analysis, design, development, and testing o Participate in design refactoring and enhancement of critical component o Developed the application using spring framework that leverages model view layer architecture, also configured Dependency Injection.\no Extensively used Hibernate in data access layer to access and update information in the database.\no Involved in the Development of Spring Framework Controllers o Developing application using Spring core module and worked on Messaging service.\no Developed user interface using JSP, JSP Tag libraries JSTL, HTML, CSS, JavaScript.\no Design highly usable GUIs using Spring Framework, JSPs, Struts MVC, HTML, JavaScript, and CSS o Worked on Single Page Applications using AngularJS which includes Routing, Directives, and Templates.\no Used JMS for the asynchronous exchange of critical business data and events amongJ2EE components and legacy system.\no Implemented a fully automated CI build and deployment infrastructure and processes for multiple",
        "tax_term": "",
        "confidence": 0.265
      }
    },
    {
      "resume_path": "data\\input\\Alexander Mai - SAS - VC.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "shield": 0.9,
          "organization": 0.9,
          "design": 0.9,
          "reporting": 0.9,
          "lit": 0.9,
          "cap": 0.9,
          "unity": 0.9,
          "sas": 0.9,
          "sql": 0.9,
          "excel": 0.9,
          "presentation": 0.9,
          "documentation": 0.9
        },
        "name": "MA                           HEDIS     M",
        "email": "",
        "phone": "7742326198",
        "location": {
          "city": "MA",
          "state": "LA",
          "zip": "02445"
        },
        "work_authority": "",
        "designation": "Business  Administration",
        "experience": "Experience Harvard Medical School Boston, MA Statistical Programmer & Data Analyst June 2016 â€“ Present â–ª Design and develop statistical and data management programs associated with grant funded",
        "tax_term": "",
        "confidence": 0.43318333333333336
      }
    },
    {
      "resume_path": "data\\input\\Enterprise Architect - NJ - Madan.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "r": 0.9,
          "xp": 0.9,
          "oracle": 0.9,
          "sql": 0.9,
          "pl/sql": 0.9,
          "db2": 0.9,
          "java": 0.9,
          "c++": 0.9,
          "jdbc": 0.9,
          "rad": 0.9,
          "svn": 0.9,
          "git": 0.9,
          "spring": 0.9,
          "spring boot": 0.9,
          "design": 0.9,
          "design patterns": 0.9,
          "soap": 0.9,
          "rest api": 0.9,
          "rest": 0.9,
          "hibernate": 0.9,
          "infrastructure": 0.9,
          "kubernetes": 0.9,
          "mesos": 0.9,
          "docker": 0.9,
          "aws": 0.9,
          "ci/cd": 0.9,
          "jenkins": 0.9,
          "puppet": 0.9
        },
        "name": "Madan Vemurie",
        "email": "",
        "phone": "8563694341",
        "location": {
          "city": "",
          "state": "",
          "zip": ""
        },
        "work_authority": "",
        "designation": "product manager",
        "experience": "Professional Experience: Client Royal Caribbean Cruise Line Manager (Enterprise Architect), PA Jan 2019-Till Date Leading the project Architecture and project delivery in the Advisory and Architecture group for Royal Caribbean Cruise on Employee track.\nI am leading the initiative to improve Employee efficiency and experience and ease of doing business on cruise.\nEMPLOYEE Track Working on design of 3 major initiative 1.\nScheduling and ILO compliance Architecture and Design.\nI am working on design and complete Architecture which will be used by delivery and executives to bring in and integrate with out of box tool.\nThis will automate all the crew members Scheduling, Time Keeping and Compliance rules engine on the ships and help to ease the employee experience 2.\nStateroom Attendant App Architecture and Design.\nI am working on a design and Architecture of an app which will be developed by RCCL team.\nThis app will be used to assign to assign guest rooms and areas of the attendants for cleaning.\nIt provides them with checklist to ensure that all areas are covered.\nAnd once attendant completes the work these are send to floor supervisors for inspection.\nSupervisor has the ability update the status of inspection and may be reject it and reassign with comments.\n3.\nJDE HCM replacement with SAP HCM initiative and working on cut over strategy of all the Ship and Shore products which are dependent on HCM.\nAnd planning the gradual systems cut over with data synching strategy, risk analysis and roll back strategy.\nInnovation and Emerging Technology Track 1.\nStarted working with Innovation Team on initiative for Kids tracking on ship during voyage.\nThis is very important for kids safety and kids will wear a WOW band and they can use the band which has a Bluetooth beepers which can be tracked by Auruba/Cisco listeners on ship.\nThe location is compiled and tracked on guest app.\n2.\nMustering 2.0 was an initiative to remove the guest pain point by removing the safety mustering at one time and giving them provisions to view videos on app or stateroom TV.\nEnvironment: UML, draw.io, Spring Boot, REST Web Services, SOAP Web Services, GSON/JSON, XSD, AWS, VMware, Kafka, TIBCO, Kubernetes, Mesos Docker.\nâž¢ Prudential (Cognizant Technology Solutions) Sr.\nManager/Delivery Executive Nov 2017- Dec 2018 Working as Technical Delivery and Sr.\nArchitect with hands on experience for a project to convert Web Method Based Services to Spring Boot services and deploying on Docker AWS.\nMy team has delivered a very fast pacing project where we have converted 100 plus Documentum Services to Spring Boot Micro Services.\nIntroduced Swagger model to write swagger Jason file and convert it to Java Code and Publishing Swagger Jason file on WS02 for testing and viewing and discovering.\nThis whole project is converted to spring boot Micro Services with all the security, common feature and adding Apigee API Gateway based security with a very small team.\nâ€¢ Involved in Design, Planning, and Co-ordination with offshore team and helped in Coding of the application common features in Service layer environment.\nâ€¢ Involved in Design and coding involving core Spring Technologies.\nâ€¢ Involved in REST Web services development and design â€¢ Trained the team with Mockito unit testing framework and Cucumber for automation testing and integration testing and implement the testing frame work with 85% of test coverage.\nâ€¢ Experience in TDD environment and created unit test cases before writing the business logic using Mockito.\nUsed Sonar with Jenkins for code coverage.\nâ€¢ Used Spring Boot framework for development and spring annotations.\nâ€¢ Created Custom Annotations and used Lombok Annotations for POJOâ€™s.\nâ€¢ CI/CD builds with Jenkins â€¢ Worked with Dev Ops team for Dockerization of services and deploying on Kubernetes.\nEnvironment: UML, Core Java, J2EE, Spring Boot, REST Web Services, SOAP Web Services, GSON/JSON, XSD, Tomcat, GIT, STS IDE, Swagger IO, APIGEE, UNIX, CI/CD, Kubernetes âž¢ TD Ameritrade (Cognizant Technology Solutions) Sr.\nArchitect/Sr.\nManager May 2017- Nov 2017 Working as API Designer and Development lead for a Rest API Pilot project in BOS Service layer team in TD Ameritrade.\nWorked on a Pilot project to initiate API design standards and Spring framework in the project.\nIntroduced Swagger model to write swagger Jason file and convert it to Java Code and Publishing Swagger Jason file on WS02 for testing and viewing and discovering.\nThis was a Pilot project to set up the Spring Framework for REST API development and introduce the team with Agile Principals.\nâ€¢ Involved in Design, Coding of the application in Service layer environment.\nâ€¢ Involved in Design and coding involving core Spring Technologies.\nâ€¢ Involved in REST Web services development and design â€¢ Experience with Mockito unit testing framework and Cucumber for automation testing and integration testing.\nâ€¢ Experience in TDD environment and created unit test cases before writing the business logic using Mockito.\nUsed Sonar with Jenkins for code coverage.\nâ€¢ Created and updated stories worked on stories on Jira tracker.\nâ€¢ Used Spring Boot framework for development and spring annotations.\nâ€¢ Created Custom Annotations and used Lombok Annotations for POJOâ€™s.\nâ€¢ Environment: UML, Core Java, J2EE, Spring Boot, REST Web Services, SOAP Web Services, GSON/JSON, XSD, Tomcat, GIT, STS , Swagger IO, WS02,UNIX âž¢ FDC (Cognizant Technology Solutions) Sr.\nArchitect/Sr.\nManager Aug 2016- April 2017 Solution design and Design work for integration with Fraud monitoring Solution with a third Party Machine Learning and Monitoring Response System Feedzai.\nDesign micro services which are currently in Production.\nAlso integration with another Smart Phone device Fraud alert system InAuth Service.\nThe client which this products are used are mainly from Exxon Mobile, Chickfilae, Tacobell.\nThis new integration is designed completely as an independent micro services which are deployed separately and have their own purpose.\nThese services are also currently on PCF (Pivotal Cloud Foundry) PaaS as a test services and intention was to move completely to PCF in future.\nResponsibilities: - â€¢ Involved in Design, Coding of the application in Service layer environment.\nâ€¢ Involved in Design and coding involving core Spring Technologies.\nâ€¢ Involved in REST Web services development and design â€¢ Experience with Mockito unit testing framework and Cucumber for automation testing and integration testing.\nâ€¢ Experience in TDD environment and created unit test cases before writing the business logic using Mockito.\nUsed Sonar with Jenkins for code coverage.\nâ€¢ Developing micro APIâ€™s and REST web services for the businesses and vendors to use.\nâ€¢ Created and updated stories worked on stories on Jira tracker.\nâ€¢ Used Spring Boot framework for development and spring annotations.\nâ€¢ Created Custom Annotations and used Lombok Annotations for POJOâ€™s.\nâ€¢ Worked on POC for Pivotal Cloud Foundry PaaS as for deployments of applications on Cloud Infrastructure.\nâ€¢ Worked on POC for API Gateway Apigee on PCF.\nâ€¢ Used JPA (Java Persistence API) Spring Data for DB design and development.\nEnvironment: UML, Core Java, J2EE, Spring Boot, JPA, REST Web Services, SOAP Web Services, GSON/JSON, XML, XSL, XSD, Web Sphere, GIT, STS, Mocito, Apigee , UNIX âž¢ United Health Care, Horsham, PA Sr.\nArchitect/Software Engineer Mar 2015- June 2016 Digital Service Medicare and Retirement Solution Summary document for a new project was developed.\nProvider Web is a web site residing within the SHIP Comprehensive Policy Administration System (COMPAS) with self-service features for providers.\nWhen it was built 11 years ago, no enterprise-wide provider portal existed, so it was built into the Policy Administration system.\nToday, there are better options, specifically, leveraging the UHC-wide Provider Portal, also known as Optum Provider Touch Point (PTP).\nOur recommendation is to align to the enterprise standard by retiring the Policy Administration system Provider Web in favor of leveraging Optum PTP.\nIn addition, the Policy Administration system has an outstanding policy exception (PEX) with UHC Corporate IT for accessing the United Claim Processing System (UCPS) system directly in order to maintain information in the UCPS Provider Database.\nTo resolve the outstanding PEX issue, the Policy Administration system will integrate with ACES provider maintenance services in order to pass information between UCPS and the Policy Administration system.\nHands on a development of micro API Services and Restful Web Service, which provides services and to business and other teams for looking up claims, Provider Demographics, plans, eligibilities, preferences, fulfillments.\nUsed Spring Boot framework with extensive unit testing using mockito framework, automation testing using Cucumber and integration testing.\nResponsibilities: - â€¢ Involved in Design, Coding of the application in SOA environment.\nâ€¢ Involved in Design and coding involving core Java technologies.\nâ€¢ Worked on REST Web services.\nâ€¢ Worked on writing unit test cases with Mockito framework and Cucumber for automation testing and integration testing.\nâ€¢ Developing micro APIâ€™s and REST web services for the businesses and vendors to use.\nâ€¢ Created and updated stories worked on stories on Pivotal tracker.\nâ€¢ Used Spring Boot framework for development and spring annotations.\nâ€¢ Created Custom Annotations and used Lombok Annotations for POJOâ€™s.\nâ€¢ Worked on POC for Openshift automatic deployments of applications on Cloud Infrastructure.\nâ€¢ Used JPA (Java Persistence API) for DB queries Environment: UML, Core Java, J2EE, Spring Boot, JPA, REST Web Services, SOAP Web Services, GSON/JSON, XML, XSL, XSD, Web Sphere, GIT, IntelliJ , UNIX Bank Of America, Newark Sr.\nArchitect/ Technical Lead Jan 2013-Feb 2015 I am currently working as a Sr.\nArchitect and Technical Lead in Bank of America in Card Technologies and Common Services team.\nI work closely with Business team and other teams on quarterly releases.\nI have worked on Fraud Activity Verification project where Business is moving the Fraud Verification service in house.\nCTCS team is mainly an Orchestration Layer between different teams and we provide Wed Services, which are consumed by different teams.\nI have also worked on Batch processes project, which is used mainly for our Mailers and Agreement printing services for customers.\nResponsibilities: - â€¢ Involved in Design, Coding of the application in SOA environment.\nâ€¢ Involved in Business requirements meeting to collect BRD requirements.\nâ€¢ Involved in Integration testing with all the teams in SOA environment.\nâ€¢ Involved in Design and coding involving core Java technologies.\nâ€¢ Worked on JBPM 6",
        "tax_term": "",
        "confidence": 0.41000000000000003
      }
    },
    {
      "resume_path": "data\\input\\Finance Manager - CA - Stepfan.doc",
      "confidence_score": 0.0,
      "used_ocr": false,
      "extracted_fields": {
        "skills": {
          "siem": 0.9,
          "r": 0.9,
          "analysis": 0.9,
          "planning": 0.9,
          "financial planning": 0.9,
          "lit": 0.9,
          "manufacturing": 0.9,
          "legal": 0.9,
          "xp": 0.9,
          "sales": 0.9,
          "reporting": 0.9,
          "program reporting": 0.9,
          "collaboration": 0.9,
          "organization": 0.9,
          "go": 0.9,
          "negotiation": 0.9,
          "contracts": 0.9,
          "gin": 0.9,
          "order management": 0.9,
          "engineering": 0.9,
          "unity": 0.9,
          "project control": 0.9,
          "sem": 0.9,
          "hyper": 0.9,
          "accounting": 0.9,
          "cap": 0.9,
          "rds": 0.9,
          "decision making": 0.9,
          "influence": 0.9,
          "construction": 0.9,
          "audit": 0.9,
          "SOX compliance": 0.9,
          "compliance": 0.9,
          "sox compliance": 0.9,
          "financial analysis": 0.9,
          "documentation": 0.9,
          "consul": 0.9,
          "regulatory requirements": 0.9,
          "government": 0.9,
          "rest": 0.9,
          "rad": 0.9,
          "express": 0.9,
          "aws": 0.9,
          "electron": 0.9,
          "mining": 0.9
        },
        "name": "Stepfan Jiles",
        "email": "",
        "phone": "9016908956",
        "location": {
          "city": "San Ramon",
          "state": "CA",
          "zip": "94583"
        },
        "work_authority": "Meetings",
        "designation": "Project Manager",
        "experience": "EXPERIENCE Pacific, Gas & Electric (PG&E) Utilities Insight Global Inc.- Finance Consultant January 2020 - Present Sr.\nProject Controlâ€™s Analyst San Ramon, Ca Schedule Development and Analysis: â€¢ In coordination with Project Manager develop project schedule and cash flow/forecast plans with functional department input.\nâ€¢ Attend Project and Job kickoff and walk down meetings.\nâ€¢ Create, maintain and update schedules.\nâ€¢ Document, monitor and communicate project milestones and risks with appropriate stakeholders.\nâ€¢ Participate in project status meetings, collect progress data and revise project plan as needed.\nâ€¢ Monitor financial progress and maintain Project Managerâ€™s order group.\nDevelop, maintain and control project schedule plans using appropriate software (for ex: SAP Project System, SAP Work Management System, and MS Project).\nCost Plan Development and Analysis: â€¢ Use the cost and schedule plan to determine if project objectives are achievable.\nCreate, maintain, and update monthly forecast budgets.\nPrepare various cost reports and maintain forecast accuracy.\nPrepare project performance analysis, cost, and schedule status reports.\nIdentify cost and schedule variances from objectives and recommend corrective action.\nâ€¢ Assess and report on project performance using established industry standards.\nâ€¢ Ensure that responses to project budget, and accrualsâ€™ cost requests reflect accurate and current project cost information and stakeholders are in concurrence.\nâ€¢ Provide regular communication on project cost, schedule and risk status to project team members, stakeholders and public.\nâ€¢ Interface with design and planning resources and software systems.\nâ€¢ Review and assist in the preparation of Advance Authorizations, Job Estimates and Re-Authorizations and assist PM in routing for approval.\nâ€¢ Prepare journal entries and coordinate or process goods receipts in current software system.\nâ€¢ Ensure that responses to budget and cost requests reflect correct project cost information and stakeholders are in concurrence.\nâ€¢ Input data into various programs and prepare various cost and forecasting reports.\nProject Documentation & Reporting: â€¢ Verify that project cost and schedule milestones were/were not attained and provide input to identify future process or business improvements and work with responsible parties to implement.\nâ€¢ Manage orders from inception through completion and all required documentation is entered in current software system (Ex: EDRS).\nâ€¢ Resolve all open items, ensure compliance requirements are met and settlement rules are entered, and close out order.\nâ€¢ Maintain scope change, contingency release, change order, and journal entry logs.\nâ€¢ Maintain written and electronic project documentation and records for required aspects of the project: Maintain project files in accordance with established guidelines and requirements (Ex: utilizing the electronic document management system or EDMS).\nâ€¢ Document change order requests, project status, key issues, risks and resolution, priority changes and approvals.\nâ€¢ Provide Project Manager with monthly report of project costs and/or schedule information including variance analysis according to an agreed upon level of detail and prioritization.\nâ€¢ Provide Project Team members with current status report containing schedule and cost information.\nComply with Utility Operations Policies, Standards and Guidelines.\nâ€¢ Assist PM with Post Job Critique.\nCentral Data Management Functions - Quality and Analysis.\nâ€¢ Prepare various monthly and weekly project management reports and report performance reports to management group including scorecards.\nâ€¢ Ensure quality of reports for the department, to report out to stakeholders.\nâ€¢ Validate weekly and monthly data sets.\nâ€¢ May provide support to project manager(s) as necessary.\nâ€¢ Fulfill ad-hoc requests for cost-related data analysis.\nâ€¢ Participate on (or lead) various process improvement initiatives within Project Management.\nCentral Financial Analysis Functions - Project Budget & Cycle Forecast Monitoring/Reporting â€¢ Prepare various monthly and weekly project performance reports - budget and cycle forecast reports; and finance status reports, utilizing the financial tracking software (e.g.\nSAP/BW system and EPM).\nâ€¢ Coordinate and work with all stakeholders, on creating new reports, that best measure and support good business decisions, to meet the Year End Annual Budget target.\nâ€¢ Coordinate and summarize project cycle forecast variance explanations for the department, to report out to stakeholders.\nâ€¢ Ensure that all responses to budget, quarterly cycle requests reflect accurate and current project cost information and stakeholders are in concurrence.\nâ€¢ Post and update all the project performance; budget and cycle forecast; and status reports on the Project Management website.\nFinancial and Performance Management â€¢ Monitor, analyze and report out on the Departmentâ€™s Forecasting Performance, with weekly performance reports, utilizing the financial tracking tools (e.g.\nSAP/BW).\nâ€¢ Analyze financial results on a monthly basis, providing explanations of significant cost drivers to PM Leadership â€“ reports such as the Green-Red Scorecard and Lessons Learned Reports.\nCordoba Corp.- Finance Consultant BART/ Santa Clara Valley Transit Authority Phase II Extension Project December 2017 â€“ January 2020 Project Finance Consultant San Jose, Ca â€¢ Lead the tracking of the capital needs of the BART/ Santa Clara Valley Transit Authority Phase II Extension Project, including project commitments, project spend, project budgets, and overhead.\nâ€¢ Maintain and update annual GAAP and cash operating forecast models.\nâ€¢ Support the strategic planning process for the Project Controlsâ€™ division.\nâ€¢ Support the Budget process and monitor the capital needs of the BART/ Santa Clara Valley Transit Authority Phase II Extension Project.\nâ€¢ Lead and track KPI's and financial metrics to inform senior leader decision making, measure divisional performance, and drive accountability.\nâ€¢ Lead Project FP&A to roll-up and map task and sub-task division models to corporate consolidated models.\nâ€¢ Prepare monthly project scope reviews and track actuals to budget; present and communicate to senior management.\nâ€¢ Perform various other financial analyses and industry related research, tracking and compiling industry trends and competitive analyses, to inform senior management strategic decision-making; effectively communicate findings to team/colleagues through presentations, memos, and other deliverables.\nâ€¢ Manage and assist in the preparation of annual project business reviews and variance analyses.\nâ€¢ Manage sub contract level ultimateâ€™s, tracking against actual activity from third party reporting.\nâ€¢ Track invoice rights and availabilities for project, supporting comprehensive agreement strategy.\nâ€¢ Support Program Management Team (PMT) Strategy and Analysis in the setup of the processes and procedures infrastructure for ongoing deal analysis for new third party venders and ongoing contracts.\nâ€¢ Perform finance/accounting, cost economics, customer and market research analysis.\nAnalyzing, interpreting and presenting data related to transportations and infrastructure market operations.\nCalifornia High Speed Rail Project April, 2017 â€“ November 2017 Sr.\nFinancial Analyst Sacramento, Ca â€¢ Accounting duties - Performs complex accounting functions for High Speed Rail Finance and Budget department, internal office departments, and program.\nAnalyzes and assigns transaction codes in accordance with state reporting and local management requirements.\nReviews and reconciles account and fund balances; reviews documents and claims for accuracy, completeness, and uniformity to rules, regulations, and laws; coordinates, prepares and reviews year-end closing process and documents.\nPerforms periodic review of financial reports and verifies accuracy and project solvency.\nâ€¢ Budget Monitoring - Support the development of budgets for internal and external customer; support the creation of new budget coding; provides information and assists staff and administrators in budget preparation, implementation, and control; prepares, balances, compiles, and enters budget data.\nSupport the preparation of quarterly revisions and billings; in accordance with Federal Railroad Administration (FRA) guidelines, monitors and evaluates federal and state fund budgets and cash flow for appropriateness to ensure solvency and accountability for compliance with state law.\nâ€¢ Financial Reporting - Prepares complex financial reports as mandated by the administration, California High Speed Rail Authority, and other agencies; assists internal and external business customers in compiling data and interpreting legal reporting requirements and regulations.\nMonitors timelines to meet strict deadlines in reporting regulations; reviews grant letters, funding and entitlement reports; reviews and verifies statistical and financial information including independent reports and long-term debt documents.\nâ€¢ Research and Data Analysis - Researches and analyzes financial data for internal and external clients; creates, organizes, and maintains files using database and spreadsheet programs; retrieves and organizes data into required reporting formats; collects, retrieves and organizes data to identify financial discrepancies and resolve client inquiries; recommends solutions to clients and staff ensuring that corrections or changes are implemented properly.\nâ€¢ Communications and Technical Support - Maintains communication with internal and external clients regarding financial matters; provides information and technical support in the development and revision of policies and regulations; assists in the development and documentation of office process updates and revisions to procedures; reviews proposed contracts for adherence to rules and regulations.\nSupport procedures for monitoring grants.\nCBRE August, 2015 â€“ Jan., 2017 Sr.\nProject Analyst/Sr.\nFinancial Analyst San Francisco, Ca â€¢ Manages a broad range of complex financial analysis and/or financial reporting activities to measure profitability for a region, line of business or large, complex client.\nIncludes the management of such functions as budgeting forecasting, financial reporting, strategic planning and management reporting processes and work product.\nâ€¢ Manages one or all of the following: capital budgeting process, capital forecasting process, capital strategic planning process, and standard management reporting.\nEstablishes overall departmental priorities and ensures that all deadlines are met.\nâ€¢ Supervises finance staff including training.\nReviews and approves certain HFM monthly journal entries.\nConducts other special financial and business studies and other duties as assigned by management.\nâ€¢ Produces a variety of routine and ad hoc financial reports, packages and pro forma analyses for senior management and planning unit.\nParticipates in the research, development and preparation of accounting policy and procedures, as required.\nMay act as consultant to management on financial policies, procedures, and applications.\nManages special",
        "tax_term": "",
        "confidence": 0.5666666666666667
      }
    }
  ]
}